export const colors = [
	{
		key: "blue",
		background: "rgba(20,20,50,0.7)",
		borderColor: "#00ffff",
		textColor: "#00ffff",
		gradient: "rgba(0,255,255,0.3)",
	},
	{
		key: "red",
		background: "rgba(50,10,10,0.7)",
		borderColor: "#ff3030",
		textColor: "#ff3030",
		gradient: "rgba(255,48,48,0.3)",
	},
	{
		key: "yellow",
		background: "rgba(50,50,10,0.7)",
		borderColor: "#ffff00",
		textColor: "#ffff00",
		gradient: "rgba(255,255,0,0.3)",
	},
	{
		key: "green",
		background: "rgba(10,50,10,0.7)",
		borderColor: "#00ff00",
		textColor: "#00ff00",
		gradient: "rgba(0,255,0,0.3)",
	},
	{
		key: "purple",
		background: "rgba(50,10,50,0.7)",
		borderColor: "#ff00ff",
		textColor: "#ff00ff",
		gradient: "rgba(255,0,255,0.3)",
	},
];

export const quotes = [
	"在这片霓虹森林里,你捕捉到了怎样的人性闪光?",
	"若能向过去的自己发送一条加密信息,内容会是什么?",
	"留下一句能穿透冰冷防火墙的,温暖的指令.",
	"为你的今日任务日志,打上三个最合适的标签。",
	"如果所有数据都将被清除,你会选择备份哪一段记忆?",
	"你的数字幽灵,会如何向世界描述你?",
	"在无穷的信息流中,哪一条是你今天的信标?",
	"描述一次你对日常算法的微小叛逆.",
	"哪段记忆像一个损坏的文件,你既想修复又害怕打开?",
	"如果你的灵魂有源代码,你会留下怎样的注释？",
	"今天，你遇到了哪个让你怀疑现实的“系统故障”？",
	"向一位网络深处的匿名过客,传递一句善意的代码.",
	"你希望未来的数据考古学家,如何解读今天的你？",
	"分享一个你希望为这个世界添加的“隐藏功能”.",
	"如果梦境是可被调用的API,你会向它请求什么数据?",
	"为一段被遗忘的过去,创建一个新的时间戳。",
	"在你的个人防火墙上,最重要的规则是哪一条？",
	"如果情感可以被编码,你最想开源哪一种？",
	"留下一条无法被搜索引擎索引的,来自内心的低语.",
	"今天,你为自己的“人生操作系统”安装了什么新补丁?",
];

export const disclaimer = `Cyber Whispers是本人独自开发的,为便于与用户交流的留言平台.请不要利用此平台服务制作、上传、下载、复制、发布、传播或者转载如下内容:<br>
  1、反对宪法所确定的基本原则的;<br>
  2、危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家 统一的;<br>
  3、损害国家荣誉和利益的;<br>
  4、煽动民族仇恨、民族歧视，破坏民族团结的;<br>
  5、破坏国家宗教政策，宣扬邪教和封建迷信的;<br>
  6、散布谣言，扰乱社会秩序，破坏社会稳定的;<br>
  7、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;<br>
  8、侮辱或者诽谤他人，侵害他人合法权益的;<br>
  9、含有法律、行政法规禁止的其他内容的信息.<br>
  留言均由用户自行发布，不代表平台立场。用户需对自己的言论独立承担全部法律责任。平台有权对违反上述规定的内容进行删除，并保留追究其法律责任的权利。`;
